[
  {
    "quiz_question": {
      "id": 6087628
    },
    "answer": {
      "format": "html_fragment",
      "value": "<p>We\n aren’t all plagued by cancer by adulthood because our bodies have \nmultiple defense mechanisms to prevent mutated cells from becoming \ncancerous. For one, most mutations are harmless and occur in \nnon-essential parts of our DNA or do not affect cell function. \nAdditionally, our cells have repair systems that identify and fix DNA \ndamage. When repair isn’t possible, damaged cells are often programmed \nto self-destruct through apoptosis. Lastly, our immune system also plays\n a key role in detecting and destroying abnormal cells before they can \nform tumors.</p>"
    },
    "earned_points": 10,
    "points_possible": 10
  },
  {
    "quiz_question": {
      "id": 6087629
    },
    "answer": {
      "format": "html_fragment",
      "value": "<p>a)\n Hallmarks related to inappropriate cell division include proliferation \n(cancer cells trigger their own replication, ignore suppression signals,\n and remove limits to cell replication) and replicative immortality \n(they evade growth suppression signals, allowing them to divide \nindefinitely).</p>\n<p>b)<strong> </strong>Hallmarks related to inappropriate cell \nsurvival include avoiding death (cancer cells ignore signals for \napoptosis and evade immune detection) and resource monopolization (such \nas angiogenesis and altered energy usage, which support their survival \nin unfavorable conditions).</p>"
    },
    "earned_points": 10,
    "points_possible": 10
  },
  {
    "quiz_question": {
      "id": 6087630
    },
    "answer": {
      "format": "html_fragment",
      "value": "<p>a)\n One major challenge in treating cancer is its similarity to normal \ncells. Cancer cells share over 99% of their DNA with healthy cells and \nuse the same biological pathways, making it hard to target cancer \nwithout harming normal tissues. This is why treatments like chemotherapy\n often have significant side effects.</p>\n<p>b) Another challenge is that cancer evolves over time, especially in \nresponse to treatments. As cancer cells are exposed to therapies \ndesigned to kill them, they adapt by developing resistance or altering \ntheir environment to survive. This ongoing evolution means that even \neffective treatments may stop working, and there can never be a \none-size-fits-all cure.</p>"
    },
    "earned_points": 10,
    "points_possible": 10
  },
  {
    "quiz_question": {
      "id": 6087631
    },
    "answer": {
      "format": "html_fragment",
      "value": "<p>a) 3,000,000,000 bp</p>\n<p>b) three billion bp</p>\n<p>c) the typical range of sizes for eukaryotic chromosomes is between            <strong> </strong>10^7 bp and 10^8 bp</p>"
    },
    "earned_points": 6,
    "points_possible": 6
  },
  {
    "quiz_question": {
      "id": 6087632
    },
    "answer": {
      "format": "html_fragment",
      "value": "<p>a) Most of the human genome is found in the category of non-coding <em>DNA</em>.\n This primarily consists of repetitive sequences, introns, regulatory \nregions, and non-coding RNAs. Although, these sections do not directly \ncode for proteins but do play important roles in gene regulation, \nchromosome structure, and other cellular processes.</p>\n<p>b) The amount of DNA in non-coding regions far exceeds the amount \nfound in protein-coding sequences. Protein coding sequences make up only\n about 1-2% of the human genome, while non-coding DNA accounts for the \nremaining 98-99%. This shows that the majority of our genetic material \nis not directly involved in coding for proteins.</p>\n<p>c) Yes, I do find these facts a bit surprising. I always thought most\n of our DNA would be used for coding proteins, since proteins are so \nimportant for all our body’s functions. The idea that only 1-2% of our \ngenome is for protein coding was unexpected. But after learning more, it\n makes sense that the non-coding regions have important roles too, like \nregulating genes and maintaining the structure of chromosomes. It shows \nhow much more complex and interconnected the genome is than I originally\n thought.</p>"
    },
    "earned_points": 12,
    "points_possible": 12
  },
  {
    "quiz_question": {
      "id": 6087633
    },
    "answer": {
      "format": "html_fragment",
      "value": "<p>a)\n Histones- are proteins that help package and organize DNA within the \ncell nucleus. They play a key role in DNA packaging by binding to the \nDNA and helping it to coil tightly.</p>\n<p>b) Nucleosome-<strong> </strong>is the basic unit of DNA packaging. \nIt consists of a segment of DNA wrapped around a core of histone \nproteins, creating a bead-like structure. Nucleosomes help condense the \nDNA into a more compact form.</p>\n<p>c) Chromatin- is the entire complex of DNA and proteins, including \nhistones, that make up chromosomes. It exists in different states of \ncondensation, depending on the cell’s needs, more relaxed chromatin \nallows for gene expression, while more tightly packed chromatin helps in\n DNA protection and efficient packaging during cell division.</p>"
    },
    "earned_points": 12,
    "points_possible": 12
  },
  {
    "quiz_question": {
      "id": 6087634
    },
    "answer": {
      "format": "html_fragment",
      "value": "<p>a.\n The causal role definition of function suggests that a biological \nfeature has a function if it plays a direct role in causing a biological\n outcome or process. In contrast, the selected effect definition of \nfunction argues that a feature has function if it was preserved through \nnatural selection because it contributed to an organism's fitness. \nEssentially, CR focuses on the current role of a trait, while SE focuses\n on its evolutionary history and adaptive value.</p>\n<p>b. Fields like molecular biology and cell biology often adopt the CR \ndefinition, where function is defined by the immediate biological role a\n molecule or structure plays. Meanwhile, evolutionary biology generally \nrelies on the SE definition, focusing on how traits are preserved by \nselection because they provide an advantage for survival or \nreproduction.</p>\n<p>c. The controversy surrounding the ENCODE consortium’s claim arises \nbecause they use the CR definition to label a large portion of the \ngenome as functional based on transcriptional activity or binding by \ntranscription factors. However, many evolutionary biologists argue that \nthese regions may not have been selected for their function, leading to \nthe debate on whether they should be considered functionally significant\n or just active without evolutionary purpose.</p>"
    },
    "earned_points": 15,
    "points_possible": 15
  },
  {
    "quiz_question": {
      "id": 6087635
    },
    "answer": {
      "format": "html_fragment",
      "value": "<p>The\n existence of organisms like the lungfish and onion, which have much \nlarger genomes than humans, do challenge the idea that most of the human\n genome has been maintained by natural selection for specific functions.\n If natural selection were primarily responsible for the preservation of\n functional DNA, we would expect genome size to correlate with the \nnumber of functions required by an organism. However, these organisms \nwith larger genomes do not have noticeably more complex functions than \nhumans, suggesting that the extra DNA may not be functional in the way \nwe traditionally think. This raises doubts about the idea that most of \nthe human genome has been selected for specific functions, as large \namounts of non-coding DNA in other species seem to persist without \nproviding obvious adaptive advantages.</p>"
    },
    "earned_points": 8,
    "points_possible": 8
  }
]